app/controllers/owners_controller.rb

    def index
        owners = Owner.all
---
SELECT "owners".* FROM "owners"

    def show
        owner = Owner.find(params[:id])
---
SELECT "owners".* FROM "owners" WHERE "owners"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]