app/controllers/vacation_homes_controller.rb

SELECT "vacation_homes".* FROM "vacation_homes"
---
    def index
        vacationhomes = VacationHome.all

SELECT "vacation_homes".* FROM "vacation_homes" WHERE "vacation_homes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def show
        vacationhome = VacationHome.find(params[:id])

INSERT INTO "vacation_homes" ("name", "owner_id", "location_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "TEst"], ["owner_id", 1], ["location_id", 3], ["created_at", "2020-01-03 04:38:10.038543"], ["updated_at", "2020-01-03 04:38:10.038543"]]
---
    def create
        vacationhome = VacationHome.create({
            name: params[:name],
            owner_id: params[:owner],
            location_id: params[:location]
        })

SELECT "vacation_homes".* FROM "vacation_homes" WHERE "vacation_homes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "vacation_homes" WHERE "vacation_homes"."id" = ?  [["id", 1]]
---
    def destroy
        vacationhome = VacationHome.find(params[:id])
        vacationhome.destroy